src/QLGiaoVienComApp/test/SuaGiaoVien_test/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlg="QLGiaoVienComApp">
  <soapenv:Body>
    <qlg:SuaGVOperation>
      <id_giaovien>7</id_giaovien>
      <choohientai>string</choohientai>
      <chucvu>string</chucvu>
      <cmnd>string1</cmnd>
      <email>string1</email>
      <gioitinh>string</gioitinh>
      <hinhanh>string</hinhanh>
      <ketnapdang>false</ketnapdang>
      <ketnapdoan>true</ketnapdoan>
      <ngaycap>2013-11-23</ngaycap>
      <ngaysinh>2014-06-09</ngaysinh>
      <ngayvaodang>2008-11-15</ngayvaodang>
      <ngayvaodoan>2017-05-14</ngayvaodoan>
      <ngayvaotruong>2013-12-21</ngayvaotruong>
      <noicap>string</noicap>
      <quequan>string</quequan>
      <sodienthoai>string</sodienthoai>
      <tengiaovien>string</tengiaovien>
      <tinhtrangsuckhoe>string</tinhtrangsuckhoe>
      <tongiao>string</tongiao>
      <trinhdodaotao>string</trinhdodaotao>
      <trinhdovanhoa>string</trinhdovanhoa>
      <id_nguoidung>4</id_nguoidung>
      <id_dantoc>1</id_dantoc>
      <id_tobomon>1</id_tobomon>
    </qlg:SuaGVOperation>
  </soapenv:Body>
</soapenv:Envelope>