trunk/src/QLGiaoVienComApp/test/layDSlopHoc/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlg="QLGiaoVienComApp">
  <soapenv:Body>
    <qlg:getLopTrongNMOperation>
      <namsau>2010</namsau>
      <namtruoc>2009</namtruoc>
    </qlg:getLopTrongNMOperation>
  </soapenv:Body>
</soapenv:Envelope>