src/QLGiaoVienComApp/test/ThemgiaoVien_test/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlg="QLGiaoVienComApp">
  <soapenv:Body>
    <qlg:themGVOperation>
      <choohientai>BinhDuong</choohientai>
      <chucvu>Khong bit</chucvu>
      <cmnd>126677</cmnd>
      <email>nguyenta12@gmail</email>
      <gioitinh>Nam</gioitinh>
      <hinhanh>ANHCUOI</hinhanh>
      <ketnapdang>false</ketnapdang>
      <ketnapdoan>true</ketnapdoan>
      <ngaycap>2013-11-23</ngaycap>
      <ngaysinh>2014-06-09</ngaysinh>
      <ngayvaodang>2008-11-15</ngayvaodang>
      <ngayvaodoan>2017-05-14</ngayvaodoan>
      <ngayvaotruong>2013-12-21</ngayvaotruong>
      <noicap>Bencat</noicap>
      <quequan>CAtben california</quequan>
      <sodienthoai>09494924</sodienthoai>
      <tengiaovien>Tran Thi hai Ba</tengiaovien>
      <tinhtrangsuckhoe>Khoe</tinhtrangsuckhoe>
      <tongiao>Khong</tongiao>
      <trinhdodaotao>Daihoc</trinhdodaotao>
      <trinhdovanhoa>HocDai</trinhdovanhoa>
      <id_dantoc>1</id_dantoc>
      <id_tobomon>1</id_tobomon>
    </qlg:themGVOperation>
  </soapenv:Body>
</soapenv:Envelope>